[
    {
        "name":"Richard Sutton",
        "department":"University of Alberta"
    },
    {
        "name":"Jieping Ye",
        "department":"University of Michigan & Beike\nVice President, Chief Scientist, Beike Inc.\nProfessor, University of Michigan, Ann Arbor\nIEEE Fellow, ACM Distinguished Scientist",
        "bio":"Dr. Jieping Ye is a VP and Chief Scientist of Beike. He is also a professor of University of Michigan, Ann Arbor. Prior to Beike, he worked at Didi Chuxing where he led DiDi AI Labs. His research interests include big data, machine learning, and data mining with applications in housing, transportation and biomedicine. He has served as a Senior Program Committee/Area Chair/Program Committee Vice Chair of many conferences including NIPS, ICML, KDD, IJCAI, ICDM, and SDM. He serves as an Associate Editor of Data Mining and Knowledge Discovery, IEEE Transactions on Knowledge and Data Engineering. He won the NSF CAREER Award in 2010. His papers have been selected for the outstanding student paper at ICML in 2004, the KDD best research paper runner up in 2013, and the KDD best student paper award in 2014. He has also won the first place in 2019 INFORMS Daniel H. Wagner Prize, one of the top awards in operation research practice. Dr. Ye was elevated to an IEEE Fellow in 2019 and named an ACM Distinguished Scientist in 2020 for his contributions to the methodology and application of machine learning and data mining.",
        "abstract":"Title: AI for Housing Marketplace KE Holdings Inc. (“Beike”) is a leading integrated online and offline platform for housing transactions and services. The company is a pioneer in building the industry infrastructure and standards in China to reinvent how service providers and housing customers efficiently navigate and consummate housing transactions, ranging from existing and new home sales, home rentals, to home renovation, real estate financial solutions, and other services. In this talk, we will discuss the challenges and opptunites for AI in housing marketplace, especially modern housing platforms like Beike. We will introduce how AI technologies have been applied to analyze unique data (including data for property, housing customers and agents) on Beike’s platform, to improve service efficiency and customer experience."
    },
    {
        "name":"Manuela Veloso",
        "department":"J.P. Morgan AI Research"},
    {
        "name":"Stefan Edelkamp",
        "department":"Czech Technical University in Prague"
    }
  ]
