[
    {
        "name":"Richard Sutton",
        "department":"University of Alberta",
        "bio": "Richard S. Sutton is a distinguished research scientist at DeepMind Alberta and a professor in the Department of Computing Science at the University of Alberta. Prior to joining DeepMind in 2017 and the University of Alberta in 2003, he worked in industry at AT&T and GTE Labs, and in academia at the University of Massachusetts. He received a PhD in computer science from the University of Massachusetts in 1984 and a BA in psychology from Stanford University in 1978. He is co-author of the textbook Reinforcement Learning: An Introduction from MIT Press. He is also a fellow of the Royal Society, the Royal Society of Canada, the Association for the Advancement of Artificial Intelligence, the Alberta Machine Intelligence Institute (Amii), and CIFAR. His research interests center on the learning problems facing a decision-maker interacting with its environment, which he sees as central to intelligence. He has additional interests in animal learning psychology, in connectionist networks, and generally in systems that continually improve their representations and models of the world. His scientific publications have been cited more than 100,000 times. He is also a libertarian, a chess player, and a cancer survivor.",
        "title": "Gaps in the Foundations of Planning with Approximation",
        "abstract": "Planning consists of imagining courses of action and their consequences, and deciding ahead of time which ones to do. In the standard reinforcement-learning model of an intelligent agent, the component that does the imagining of consequences is called the transition model of the environment, and the deciding in advance is via a change in the agent’s policy. Planning and model learning have been studied for seven decades and yet remain largely unsolved in the face of genuine approximation—models that do not become exact in the high-data limit. In this talk I briefly assess the challenges of extending dynamic-programming-style planning (value iteration) in the five most important ways: function approximation, partial observability, stochastic transitions, average reward, and temporal abstraction (options). My assessment is that these extensions are straightforward until they are combined with genuine approximation in the model, in which case we have barely a clue how to proceed in a scalable way. Nevertheless, we do have a few clues; I suggest the ideas of expectation models, metadata, and representation search as general strategies for learning approximate environment models suitable for use in planning. "
    },
        {
        "name":"Manuela Veloso",
        "department":"J.P. Morgan AI Research"},
    {
        "name":"Jieping Ye",
        "department":"University of Michigan & Beike\nVice President, Chief Scientist, Beike Inc.\nProfessor, University of Michigan, Ann Arbor\nIEEE Fellow, ACM Distinguished Scientist",
        "bio":"Dr. Jieping Ye is a VP and Chief Scientist of Beike. He is also a professor of University of Michigan, Ann Arbor. Prior to Beike, he worked at Didi Chuxing where he led DiDi AI Labs. His research interests include big data, machine learning, and data mining with applications in housing, transportation and biomedicine. He has served as a Senior Program Committee/Area Chair/Program Committee Vice Chair of many conferences including NIPS, ICML, KDD, IJCAI, ICDM, and SDM. He serves as an Associate Editor of Data Mining and Knowledge Discovery, IEEE Transactions on Knowledge and Data Engineering. He won the NSF CAREER Award in 2010. His papers have been selected for the outstanding student paper at ICML in 2004, the KDD best research paper runner up in 2013, and the KDD best student paper award in 2014. He has also won the first place in 2019 INFORMS Daniel H. Wagner Prize, one of the top awards in operation research practice. Dr. Ye was elevated to an IEEE Fellow in 2019 and named an ACM Distinguished Scientist in 2020 for his contributions to the methodology and application of machine learning and data mining.",
        "title": "AI for Housing",
        "abstract":"Marketplace KE Holdings Inc. (“Beike”) is a leading integrated online and offline platform for housing transactions and services. The company is a pioneer in building the industry infrastructure and standards in China to reinvent how service providers and housing customers efficiently navigate and consummate housing transactions, ranging from existing and new home sales, home rentals, to home renovation, real estate financial solutions, and other services. In this talk, we will discuss the challenges and opptunites for AI in housing marketplace, especially modern housing platforms like Beike. We will introduce how AI technologies have been applied to analyze unique data (including data for property, housing customers and agents) on Beike’s platform, to improve service efficiency and customer experience."
    },
    {
        "name":"Stefan Edelkamp",
        "department":"Czech Technical University in Prague",
        "bio": "Before joining the AI Center, Faculty of Electrical Engineering, Czech Technical University in Prague (CTU) as Full Professor, Stefan Edelkamp was leading the planning group at King's College London. During his exciting research career, Stefan was also working in the Department of Computer Science at Freiburg University, at the Institute for Artificial Intelligence, Faculty of Computer Science and Mathematics of the University of Bremen, and at the University of Applied Science in Darmstadt. For a short period of time, he held the position of an Interim Professor at the University of Koblenz-Landau, and at the  University Paris-Dauphine. Stefan earned his Ph.D. and habilitation degree from Freiburg University and led a junior research group at Technical University of Dortmund.",
        "title": "Combining task with motion planning",
        "abstract": "Multi-goal task planning has been an optimization question in Operation Research and Logistics for a long time. We will present novel advances for high-speed solving these discrete planning problems. With fast single-source shortest path search, the map is condensed into a graph of customer orders.  \nWhile the discrete multi-goal task planning problem is already hard, the \"physical\" motion planning problem is even more demanding. The integration of task and motion planning is considered one the most important problems in robotics nowadays. Robots have sizes, heading, and velocity, and their motion can often be described only according to non-linear differential equations. The dynamics of movements, existing obstacles and many waypoints to visit are only some of the challenges to face. In real-world problems, we often have additional constraints like inspecting areas of interest in some certain order, while still minimizing the time for the travel. The trickiest part is to solve the hard combinatorial discrete tasks like the generalized and clustered traveling salesman problems, and - at the same time - providing valid trajectories for the robot. We extend a framework in which a motion tree is steadily grown, and abstractions to discrete planning problems are used as a heuristic guidance for the on-going solution process to eventually visit all waypoints. In case of inspection, we generate the waypoints fully automatically, using a combination of skeletonization methods together with a filtering mechanism based on hitting sets.\nRobots used for inspection or moving of goods are also often required to visit certain locations subject to time and resource consumption. This requires not only planning collision-free and dynamically feasible motions, but also reasoning about constraints. To effectively solve this open problem, we couple task planning over a discrete abstraction with sampling-based motion planning over the continuous state space of feasible motions. The discrete abstraction is obtained by imposing a roadmap that captures the connectivity of the free space. We increase the expressiveness and scalability of the approach, as we raise the number of goals and the difficulty of satisfying the time and resource constraints. With our technology we are able to efficiently generate and execute long-term missions in real-time. The robot, the environment model, and the planning problem specification can be modified non-intrusively, essential in many application scenarios. Other topics of interest are robot planning with limits in energy consumption."
    }
  ]
